In [1]:
import pandas as pd

In [4]:
#Lista
data = [['Juan', 25, 'Dirección 1'], ['Maria', 35, 'Dirección 2'], ['Pedro', 45, 'Dirección 3']]
df = pd.DataFrame(data, columns=['Nombre', 'Edad', 'Dirección'])
df

  Nombre  Edad    Dirección
0   Juan    25  Dirección 1
1  Maria    35  Dirección 2
2  Pedro    45  Dirección 3

In [5]:
#Diccionario

data = {
    'Nombre': ['Juan', 'Maria', 'Pedro'],
    'Edad': [25, 35, 45]
}

df = pd.DataFrame(data)
df

  Nombre  Edad
0   Juan    25
1  Maria    35
2  Pedro    45

In [7]:
#Leer csv

df = pd.read_csv('./data/data.csv')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [8]:
df = pd.read_csv('./data/data', sep='|')
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [9]:
df = pd.read_json('./data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
print(df.head()) #Muestra de 5 registros

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [12]:
print(df.tail())

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [14]:
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [15]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [16]:
df['ciudad'] #Para una columna

0       Madrid
1    Barcelona
2      Sevilla
Name: ciudad, dtype: object

In [17]:
df[['nombre', 'edad', 'ciudad']]

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [18]:
df[df['edad']>25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [20]:
data = {
    'Grupo':['A', 'B', 'A', 'A', 'B'],
    'Valor':[10, 15, 35, 67, 38]
}

df = pd.DataFrame(data)
df

  Grupo  Valor
0     A     10
1     B     15
2     A     35
3     A     67
4     B     38

In [21]:
promedio = df.groupby('Grupo').mean()
promedio

           Valor
Grupo
A      37.333333
B      26.500000

In [22]:
suma = df.groupby('Grupo').sum()
suma

       Valor
Grupo
A        112
B         53

In [23]:
df['Valor_Doble'] = df['Valor'].apply(lambda x:x*2)
df

  Grupo  Valor  Valor_Doble
0     A     10           20
1     B     15           30
2     A     35           70
3     A     67          134
4     B     38           76

In [24]:
df['Suma'] = df.apply(lambda row: row['Valor']+row['Valor_Doble'], axis=1)
df

  Grupo  Valor  Valor_Doble  Suma
0     A     10           20    30
1     B     15           30    45
2     A     35           70   105
3     A     67          134   201
4     B     38           76   114